PeterVranken/DEVKIT-MPC5748G-flashBootLoader/FBL/code/system/drivers/flashROM/eap_eraseAndProgram.c
/*
 * Function implementation
 */

/**
 * Helper: All flash blocks are (initially) protected against erasure and programming;
 * over-programming is disabled, too.
 */
static void disableAllFlashBlocks(void)
{
#if defined(MCU_MPC5748G)
# define LOCK_ALL_BLKS_0    0xBFFFFFFFu
# define LOCK_ALL_BLKS_1    0xFFFFFFFFu
# define LOCK_ALL_BLKS_2    0xFFFFFFFFu
# define LOCK_ALL_BLKS_3    0xFFFFFFFFu
# define SELECT_NO_BLK_0    0x00000000u
# define SELECT_NO_BLK_1    0x00000000u
# define SELECT_NO_BLK_2    0x00000000u
# define SELECT_NO_BLK_3    0x00000000u
#elif defined(MCU_MPC5775B) || defined(MCU_MPC5775E)
# error Specify flash block configuration for MPC5775B/E
#elif defined(MCU_MPC5777C)
# error Specify flash block configuration for MPC5777C
#endif

    /* Lock all blocks against erasure and programming. RM 74.1.1.1ff, pp.3639ff. */
    C55FMC->LOCK0 = LOCK_ALL_BLKS_0;
    C55FMC->LOCK1 = LOCK_ALL_BLKS_1;
    C55FMC->LOCK2 = LOCK_ALL_BLKS_2;
    C55FMC->LOCK3 = LOCK_ALL_BLKS_3;

    /* Unselect all blocks from erasure. Dito. */
    C55FMC->SEL0 = SELECT_NO_BLK_0;
    C55FMC->SEL1 = SELECT_NO_BLK_1;
    C55FMC->SEL2 = SELECT_NO_BLK_2;
    C55FMC->SEL3 = SELECT_NO_BLK_3;

} /* disableAllFlashBlocks */


/**
 * Enable those flash blocks, which are required for an intended erase or program activity.
 *   @param[in] addressFrom
 * The required blocks are specified by the address range, which is affected by the
 * intended activity. All flash blocks, which share at least one byte with the specified
 * address range, will be enabled, all others don't. This is the first address of the
 * range.\n
 *   Note, addressFrom and \a noBytes need to from a valid, supported address range in the
 * flashable area. This can be checked beforehand using rom_isValidFlashAddressRange().
 *   @param[in] noBytes
 * This is the length in Byte of the address range.\n
 *   Note, if the intended activity is programming, then this value needs to be
 * #EAP_C55FMC_SIZE_OF_QUAD_PAGE, the size of a single programmed (quad-)page.
 *   @param[in] isErase
 * A Boolean flag selects the intended activity. Pass \a true if the blocks are enabled for
 * erasure and \a false if they are enabled for programming.
 */
static void enableFlashBlocks(uint32_t addressFrom, uint32_t noBytes, bool isErase)
{
    const uint32_t addressTo = addressFrom + noBytes;
    
    /* We address to the lock and select registers as an array. */
    _Static_assert
        ( (uintptr_t)&C55FMC->LOCK1 == (uintptr_t)&C55FMC->LOCK0 + 1*sizeof(C55FMC->LOCK0)
          &&  (uintptr_t)&C55FMC->LOCK2 == (uintptr_t)&C55FMC->LOCK0 + 2*sizeof(C55FMC->LOCK0)
          &&  (uintptr_t)&C55FMC->LOCK3 == (uintptr_t)&C55FMC->LOCK0 + 3*sizeof(C55FMC->LOCK0)
          &&  (uintptr_t)&C55FMC->SEL1 == (uintptr_t)&C55FMC->SEL0 + 1*sizeof(C55FMC->SEL0)
          &&  (uintptr_t)&C55FMC->SEL2 == (uintptr_t)&C55FMC->SEL0 + 2*sizeof(C55FMC->SEL0)
          &&  (uintptr_t)&C55FMC->SEL3 == (uintptr_t)&C55FMC->SEL0 + 3*sizeof(C55FMC->SEL0)
        , "Addressing of registers as an array fails"
        );

    /* We always program single quad-pages. */
    assert(isErase ||  noBytes == EAP_C55FMC_SIZE_OF_QUAD_PAGE);
    
    /* If we see an overflow then we definitly have an invalid address space. (ROM at the
       very end of the address space is not supported by the implementation.) A valid adress
       ranges is a prerequiste of calling this function. */
    assert(addressTo >= addressFrom);

    /* We check for each flash block if it is touched and needs to be enabled. We don't do
       the opposite; we don't check if all enabled flash blocks really cover the complete
       desired address range. If the address range is valid, should be checked beforehand.
         The search loop is optimize for the frequent calls of this function in programming
       mode: We inspect the last recently enabled block first. */
    _Static_assert(sizeOfAry(flashBlockDescAry) <= 256u, "Overflow of uint8_t idxBlk_");
    static uint8_t SBSS_OS(idxBlk_) = 0u;
    for(unsigned int u=0u; u<sizeOfAry(flashBlockDescAry); ++u, ++idxBlk_)
    {
        if(idxBlk_ >= sizeOfAry(flashBlockDescAry))
            idxBlk_ = 0u;
            
        const flashBlockDesc_t * const pBlkDesc = &flashBlockDescAry[idxBlk_];
        if(pBlkDesc->addrFrom < addressTo  &&  pBlkDesc->addrTo > addressFrom)
        {
            /* This flash block needs to be unlocked. */
            volatile uint32_t * const lockRegAry = &C55FMC->LOCK0;
            assert((lockRegAry[pBlkDesc->idxLockReg] & pBlkDesc->bitMaskLockReg) != 0u);
            lockRegAry[pBlkDesc->idxLockReg] &= ~pBlkDesc->bitMaskLockReg;
            
            /* Erased blocks need to be explicitly selected. */
            if(isErase)
            {
                volatile uint32_t * const selectRegAry = &C55FMC->SEL0;
                assert((selectRegAry[pBlkDesc->idxLockReg] & pBlkDesc->bitMaskLockReg) == 0u);
                selectRegAry[pBlkDesc->idxLockReg] |= pBlkDesc->bitMaskLockReg;
                #if 1
                iprintf( "Select flash block %06lX..%06lX for erasure.\r\n"
                       , pBlkDesc->addrFrom
                       , pBlkDesc->addrTo
                       );
                #endif
            }
            else
            {
                /* We always program single quad-pages, so there can't be more than one
                   touched flash block. */
                #if 1
                iprintf( "Unlock flash block %06lX..%06lX for programming.\r\n"
                       , pBlkDesc->addrFrom
                       , pBlkDesc->addrTo
                       );
                #endif
                break;
            }
        }
    } /* for(All configured flash blocks.) */

} /* enableFlashBlocks */


/**
 * Initialize the flash ROM driver.
 */
void eap_osInitFlashRomDriver(void)
{
    eap_abortEraseAndProgram();

#ifdef DEBUG
    for(unsigned int idxBlk=0u; idxBlk<sizeOfAry(flashBlockDescAry); ++idxBlk)
    {
        const flashBlockDesc_t * const pBlkDesc = &flashBlockDescAry[idxBlk];
        
        /* The flash driver generally doesn't consider overflow in address calculations and
           it uses end addresses exclusively. This make the code fail for architectures,
           which have a flash ROM block at the very end of the implementation range of
           address variables, which uses type uint32_t. The end address of such a block
           would become 0 - which could be correct but which is simply not supported. (If
           your architecture by accident has such a flash block then the easiest way out
           would be sacrificing the last page of that block.) */
        assert(pBlkDesc->addrTo > 0u);
        
