PeterVranken/DEVKIT-MPC5748G-flashBootLoader/FBL/code/system/drivers/flashROM/eap_eraseAndProgram.c
        /* A flash block must not be empty. */
        assert(pBlkDesc->addrFrom < pBlkDesc->addrTo);
        
        /* A flash-block must begin and end on a quad-page boundary. */
        assert(EAP_GET_ADDR_OFFS_IN_QUAD_PAGE(pBlkDesc->addrFrom) == 0u
               &&  EAP_GET_ADDR_OFFS_IN_QUAD_PAGE(pBlkDesc->addrTo) == 0u
              );
              
        /* We have 4 lock and select registers. */
        assert(pBlkDesc->idxLockReg < 4u);
        
        /* Each flash block is represented by excately one bit in these registers. */
        #define HAS_ONE_BIT_SET(x)  ((x)!=0u && ((x)&((x)-1u))==0u)
        assert(HAS_ONE_BIT_SET(pBlkDesc->bitMaskLockReg));
        #undef HAS_ONE_BIT_SET

# if defined(MCU_MPC5748G)
        /* For the MPC5748G, the implementation of the address range validity is based on
           the fact, that all flash blocks form a single, contiguous address space. Gaps
           are not considered. */
        assert(idxBlk == 0u  ||  pBlkDesc->addrFrom == flashBlockDescAry[idxBlk-1].addrTo);
# endif
        

    } /* for(Check flash block specification table entries for plausibility) */
    
# if defined(MCU_MPC5748G)
    /* For the MPC5748G, the implementation of the address range validity uses hard-coded
       address boundaries. We need to check consistency. */
    assert(rom_isValidFlashAddressRange(flashBlockDescAry[0].addrFrom, /*size*/ 0u)
           && !rom_isValidFlashAddressRange(flashBlockDescAry[0].addrFrom-1u, /*size*/ 0u)
           && rom_isValidFlashAddressRange
                                ( flashBlockDescAry[sizeOfAry(flashBlockDescAry)-1].addrTo
                                , /*size*/ 0u
                                )
           && !rom_isValidFlashAddressRange
                                ( flashBlockDescAry[sizeOfAry(flashBlockDescAry)-1].addrTo+1u
                                , /*size*/ 0u
                                )
          );
# endif

#endif /* DEBUG */

} /* eap_osInitFlashRomDriver */


/**
 * Start the erasure of one or more flash blocks in the C55 controller.
 *   The preconditions are checked (availability of controller for erasure) the wanted
 * blocks are selected and the high voltage is enabled, which makes the flash erasure
 * begin. The function is non-blocking and doesn't wait for the termination of the erasure.
 * Use eap_osGetStatusEraseFlashBlocks() to find out, when it has terminated.
 *   @return
 * Get the status of the operation. eap_osStartEraseFlashBlocks() or
 * eap_osStartProgramQuadPage() can be called earliest again when this function returns
 * either success or failure - but not yet while it reports a pending state
 * (#rom_err_processPending).
 *   @param[in] addressFrom
 * The blocks to erase are specified by the address range, which needs to become blank. All
 * flash blocks, which share at least one byte with the specified address range, will be
 * erased, all others don't. This is the first blanked address.
 *   @param[in] noBytes
 * This is the length in Byte of the address range.
 */
rom_errorCode_t eap_osStartEraseFlashBlocks(uint32_t addressFrom, uint32_t noBytes)
{
    rom_errorCode_t retCode;
    const uint32_t mcr = C55FMC->MCR;

    if(!rom_isValidFlashAddressRange(addressFrom, noBytes))
    {
        retCode = rom_err_badAddressRange;      
    }

    /* To initiate erasure, no other operation must be in progress. */
    #define BITS_TO_BE_CLEARED  (C55FMC_MCR_ERS_MASK     \
                                 |C55FMC_MCR_PGM_MASK    \
                                 |C55FMC_MCR_EHV_MASK    \
                                 |C55FMC_MCR_PSUS_MASK   \
                                 |C55FMC_MCR_ESUS_MASK   \
                                )
    else if((mcr & BITS_TO_BE_CLEARED) == 0u)
    #undef BITS_TO_BE_CLEARED
    {
        /* Enable the flash blocks for erase, which are touched by the address range. */
        /* Set MCR[ERS] to start erase operation. */
        C55FMC->MCR |= C55FMC_MCR_ERS_MASK;

// TODO Generalize
//        assert(addressFrom >= 0xFC0000u  &&  addressFrom+noBytes <= 0xFC8000u);
//        C55FMC->LOCK0 &= ~C55FMC_LOCK0_LOWLOCK(4u); /* Bit 2: 0xFC0000..0xFC8000. */
//        C55FMC->SEL0 = C55FMC_LOCK0_LOWLOCK(4u); /* Bit 2: 0xFC0000..0xFC8000. */
        enableFlashBlocks(addressFrom, noBytes, /*isErase*/ true);

        /* The interlock write needs to be done prior to enabling the high voltage. We
           need to write anywhere into a flash block to be erased. For simplicity, we
           choose the first address of the range. RM48, 74.6.1.3, p.3686, 3. */
        *(volatile uint32_t*)addressFrom = 0xFFFFFFFFu;

        /* We set MCR[EHV] to turn on the high voltage for erasing. See RM48, 74.5.1,
           p.3656. */
        C55FMC->MCR |= C55FMC_MCR_EHV_MASK;

        /* This is a non-blocking function. We don't wait for the result but will check
           it in the next clock tick. */
        retCode = rom_err_processPending;
    }
    else
    {
        /* Turn off high voltage and reset all operation request bits. */
        eap_abortEraseAndProgram();

// TODO Generalize and centralize
//        C55FMC->LOCK0 |= C55FMC_LOCK0_LOWLOCK(4u); /* Bit 2: 0xFC0000..0xFC8000. */
//        C55FMC->SEL0 &= ~C55FMC_LOCK0_LOWLOCK(4u); /* Bit 2: 0xFC0000..0xFC8000. */
        retCode = rom_err_unexpectedHwState;
    }

    return retCode;

} /* eap_osStartEraseFlashBlocks */


/**
 * Check the status of an erase operation, which had been initiated before by
 * eap_osStartEraseFlashBlocks().
 *   @return
 * Get the status of the operation. eap_osStartEraseFlashBlocks() or
 * eap_osStartProgramQuadPage() can be called earliest again when this function returns
 * either success or failure - but not yet while it reports a pending state
 * (#rom_err_processPending).
 */
rom_errorCode_t eap_osGetStatusEraseFlashBlocks(void)
{
    rom_errorCode_t retCode;

    /* Did we initiate an erase operation before? Without this bit set, MCR[DONE] would be
       meaningless. */
    const uint32_t mcr = C55FMC->MCR;
    #define BITS_TO_BE_SET      (C55FMC_MCR_ERS_MASK|C55FMC_MCR_EHV_MASK)
    #define BITS_TO_BE_CLEARED  (C55FMC_MCR_PGM_MASK|C55FMC_MCR_PSUS_MASK|C55FMC_MCR_ESUS_MASK)
    if((mcr & BITS_TO_BE_SET) == BITS_TO_BE_SET  &&  (mcr & BITS_TO_BE_CLEARED) == 0u)
    #undef BITS_TO_BE_SET
    #undef BITS_TO_BE_CLEARED
    {
        /* MCR[DONE] indicates completion. */
        if((mcr & C55FMC_MCR_DONE_MASK) != 0u)
        {
            /* Check MCR[PEG]. A zero bit indicates an erase error. */
            if((mcr & C55FMC_MCR_PEG_MASK) != 0u)
                retCode = rom_err_noError;
            else
                retCode = rom_err_c55FmcErrorInPeg;
        }
        else
        {
            /* MCR[DONE]=0: The operation is still in progress. We wait till next clock
               tick for the next check. */
            retCode = rom_err_processPending;
        }
    }
    else
        retCode = rom_err_unexpectedHwState;

    if(retCode != rom_err_processPending)
    {
        /* Turn off high voltage and reset all operation request bits. */
        eap_abortEraseAndProgram();

// TODO Generalize and centralize
//        C55FMC->LOCK0 |= C55FMC_LOCK0_LOWLOCK(4u); /* Bit 2: 0xFC0000..0xFC8000. */
//        C55FMC->SEL0 &= ~C55FMC_LOCK0_LOWLOCK(4u); /* Bit 2: 0xFC0000..0xFC8000. */
    }

