PeterVranken/DEVKIT-MPC5748G-flashBootLoader/FBL/code/system/drivers/flashROM/eap_eraseAndProgram.c
    return retCode;
    
} /* eap_osGetStatusEraseFlashBlocks */


/**
 * Start the programming of a single quad-page in the C55 controller.\n
 *   The preconditions are checked (availability of controller for new write-page
 * operation), the write buffer is filled with the data and high voltage is enabled, which
 * makes the flash programming begin. The function is non-blocking and doesn't wait for the
 * termination of the program step. Use eap_osGetStatusProgramQuadPage() to find out, when
 * it has terminated.
 *  @return
 * Get the status: If everything succeeded, then it is pending (#rom_err_processPending),
 * otherwise an error message.
 *  @param[in] pPrgDataBuf
 * The buffer with the data to program and the target address in flash ROM.
 */
rom_errorCode_t eap_osStartProgramQuadPage(eap_quadPageProgramBuffer_t * const pPrgDataBuf)
{
    rom_errorCode_t retCode;
    const uint32_t mcr = C55FMC->MCR;
    
    if( EAP_GET_ADDR_OFFS_IN_QUAD_PAGE(pPrgDataBuf->address) != 0u
        || !rom_isValidFlashAddressRange(pPrgDataBuf->address, EAP_C55FMC_SIZE_OF_QUAD_PAGE)
      )
    {
        retCode = rom_err_badAddressRange;      
    }
    
    /* To initiate programming, no other operation must be in progress. */
    #define BITS_TO_BE_CLEARED  (C55FMC_MCR_ERS_MASK     \
                                 |C55FMC_MCR_PGM_MASK    \
                                 |C55FMC_MCR_EHV_MASK    \
                                 |C55FMC_MCR_PSUS_MASK   \
                                 |C55FMC_MCR_ESUS_MASK   \
                                )
    else if((mcr & BITS_TO_BE_CLEARED) == 0u)
    #undef BITS_TO_BE_CLEARED
    {
        /* Enable the flash block for programming, which the wanted quad-page sits in. */
// TODO Generalize
//        assert(pPrgDataBuf->address >= 0xFC0000u  &&  pPrgDataBuf->address+128u <= 0xFC8000u);
//        C55FMC->LOCK0 &= ~C55FMC_LOCK0_LOWLOCK(4u); /* Bit 2: 0xFC0000..0xFC8000. */
        enableFlashBlocks( pPrgDataBuf->address
                         , EAP_C55FMC_SIZE_OF_QUAD_PAGE
                         , /*isErase*/ false
                         );
        
        /* Set MCR[PGM] to start program operation. */
        C55FMC->MCR |= C55FMC_MCR_PGM_MASK;

        /* We always write an entire quad-page at once. */

        /* Copy quad-page contents into the controller's data buffer. This is at the
           same time the required interlock write. */
        const uint32_t *pRd = &pPrgDataBuf->data_u32[0];
        volatile uint32_t *pWr = (volatile uint32_t*)pPrgDataBuf->address;

        _Static_assert(EAP_C55FMC_SIZE_OF_QUAD_PAGE % 4u == 0u, "Bad configuration");
        for(unsigned int u=0u; u<EAP_C55FMC_SIZE_OF_QUAD_PAGE/4u; ++u)
            * pWr++ = * pRd++;

        /* After filling the write buffer, we set MCR[EHV] to turn on the high voltage
           for flashing. See RM48, 74.5.1, p.3656. */
        C55FMC->MCR |= C55FMC_MCR_EHV_MASK;

        /* This is a non-blocking function. We don't wait for the result but will check
           it in the next clock tick. */
        retCode = rom_err_processPending;
    }
    else
    {
        /* Turn off high voltage and reset all operation request bits. */
        eap_abortEraseAndProgram();

// TODO Generalize and centralize
//        C55FMC->LOCK0 |= C55FMC_LOCK0_LOWLOCK(4u); /* Bit 2: 0xFC0000..0xFC8000. */
//        C55FMC->SEL0 &= ~C55FMC_LOCK0_LOWLOCK(4u); /* Bit 2: 0xFC0000..0xFC8000. */
        retCode = rom_err_unexpectedHwState;
    }

    return retCode;

} /* eap_osStartProgramQuadPage */


/**
 * Check the status of a programming operation, which had been initiated before by
 * eap_osStartProgramQuadPage().
 *   @return
 * Get the status of the operation. eap_osStartEraseFlashBlocks() or
 * eap_osStartProgramQuadPage() can be called earliest again when this function returns
 * either success or failure - but not yet while it reports a pending state
 * (#rom_err_processPending).
 */
rom_errorCode_t eap_osGetStatusProgramQuadPage(void)
{
    rom_errorCode_t retCode;

    /* There must be a program operation but no suspend or erase visible. */
    const uint32_t mcr = C55FMC->MCR;
    #define BITS_TO_BE_SET      (C55FMC_MCR_PGM_MASK|C55FMC_MCR_EHV_MASK)
    #define BITS_TO_BE_CLEARED  (C55FMC_MCR_ERS_MASK|C55FMC_MCR_PSUS_MASK|C55FMC_MCR_ESUS_MASK)
    if((mcr & BITS_TO_BE_SET) == BITS_TO_BE_SET  &&  (mcr & BITS_TO_BE_CLEARED) == 0u)
    #undef BITS_TO_BE_SET
    #undef BITS_TO_BE_CLEARED
    {
        /* Check MCR[DONE]. 1 means operation done. */
        if((mcr & C55FMC_MCR_DONE_MASK) != 0u)
        {
            /* Check MCR[PEG]. A zero bit indicates a programming error. */
            if((mcr & C55FMC_MCR_PEG_MASK) != 0u)
                retCode = rom_err_noError;
            else
                retCode = rom_err_c55FmcErrorInPeg;
        }
        else
        {
            /* MCR[DONE]=0: The operation is still in progress. We wait till next clock
               tick for the next check. */
            retCode = rom_err_processPending;
        }
    }
    else
        retCode = rom_err_unexpectedHwState;

    if(retCode != rom_err_processPending)
    {
        /* Turn off high voltage and reset all operation request bits. */
        eap_abortEraseAndProgram();

// TODO Generalize and centralize
//        C55FMC->LOCK0 |= C55FMC_LOCK0_LOWLOCK(4u); /* Bit 2: 0xFC0000..0xFC8000. */
//        C55FMC->SEL0 &= ~C55FMC_LOCK0_LOWLOCK(4u); /* Bit 2: 0xFC0000..0xFC8000. */
    }

    return retCode;

} /* eap_osGetStatusProgramQuadPage */


/**
 * This function stops all erase and program activities of the C55FMC.\n
 *   It can be called in case of errors or unexpected states.
 */
void eap_abortEraseAndProgram(void)
{
    /* The mode of operation bits are disabled in distinct steps. This is a rule from
       the bit locking. RM48, 74.6, Table 74-3, p.3679. */
    // TODO Abortion is likely not properly implemented. Compare conditions RM48, 74.5.1, p.3656, for resetting EHV. However, seems to affect only modes, we don't use anyway
    C55FMC->MCR &= ~C55FMC_MCR_PSUS_MASK;
    C55FMC->MCR &= ~C55FMC_MCR_ESUS_MASK;
    C55FMC->MCR &= ~C55FMC_MCR_EHV_MASK;
    C55FMC->MCR &= ~C55FMC_MCR_PGM_MASK;
    C55FMC->MCR &= ~C55FMC_MCR_ERS_MASK;

    /* Now we can restore the default settings for accesibility the of flash blocks. */
    disableAllFlashBlocks();

} /* eap_abortEraseAndProgram */


